// Ойынды бастау
alert("Қош келдіңіз, саяхатшы! Сіз саяхатқа шыққалы жатырсыз. Сіздің таңдауыңыз - сіздің тағдырыңызды анықтайды.");

// Пайдаланушының атын сұрау
let name = prompt("Сіздің атыңыз кім");
alert("Қош келдіңіз  " + name + "   Сіздің шытырман окиганыз басталгалы тур");

// 1-қадам

let choice1 = prompt("Сіз қиылыста тап боласызз Сіз солға немесе оңға барасыз ба");

if ( choice1 == "Сол" || choice1 == "сол" ||  choice1 == "Солға" || choice1 == "Солға" ) {
    alert("Ол жакта калын орман "); 
} else if ( choice1 == "оң" || choice1 == "Оң" ||  choice1 == "Оңға" || choice1 == "оңға" ) {
    alert ("Кышкентай калашық бар")
}

// 2-қадам
let choice2 = prompt("Сіз өзенді көріп тұрсыз. Сіз салдың үстінен жүзесіз бе әлде қайық жасайсыз ба?");

if ( choice2 == "Жүзу" || choice2 == "Жүземін" ||  choice2 == "жүземін" || choice2 == "жүзу" ) {
    alert("Жузып оту"); 
} else if ( choice2 == "қайық жасау" || choice2 == "Қайық жасау" ||  choice2 == "қайық жасаймын" || choice2 == "Қайық жасаймын" ) {
    var boat = prompt('Оны агаштан жасайсыз ба');
    if (boat == 'иә' || boat == 'Иә') {
        alert ('Оны озенын жанында турган агаштардан алып жаса');
    } else if (isMorning == 'Жоқ' || isMorning == 'Жоқ') {
        alert('Тогда шоппен жаса');
    }
}   


 // 3-қадам
 let choice3 = prompt("Сіз ескі ғибадатхананы көресіз. Сіз ішке кіресіз бе әлде сыртта қаласыз ба");

 if (choice3 == "Кіремін" || choice3 == "кіремін") {
    alert("сиз гибадатханадан казына таптынызын, жолыныз болсын!")
 } else if (choice3 == "сыртта калу" || choice3 == "Сыртта калу") {
    alert ("Cіз бір топ аншынын колына түсіп калдыныз");
 }